{
    "Montreal, QC": "Montreal, QC",
    "English": "English",
    "French": "French",
    "My LinkedIn": "My LinkedIn",
    "My Github": "My Github",
    "Software Engineering": "Software Engineering",
    "Computer Science (Certificate)": "Computer Science (Certificate)",
    "Computer Science & technology": "Computer Science & technology",
    "Vanier College": "Vanier College",
    "Rest API application": "Rest API application",
    "Web development": "Web development",
    "My CV": "My CV",
    "Personal information": "Personal information",
    "Skillset": "Skillset",
    "Education": "Education",
    "Work experience": "Work experience",
    "Technologies": "Technologies",
    "Personal highlights": "Personal highlights",
    "In progress": "In progress",
    "Banner.intro": "If you're looking for a skilled web developer with a passion for creating professional websites, look no further! With 4 years of experience in the field, I'm dedicated to delivering high-quality work that meets my clients' needs and exceeds their expectations. Whether you're looking for a simple, elegant website or a complex, feature-rich platform, I have the expertise and creativity to bring your vision to life. Let's work together to build something amazing!",
    "GoTo": {
        "a": "In charge of developing legacy features (modularly) into a newer platform using <strong>React</strong>, transitionning <strong>85% of clients</strong>",
        "b": "Developed <strong>unit tests</strong> with a minimum <strong>coverage of 70%</strong> using <strong>Jest</strong> and <strong>React testing library packages</strong>",
        "c": "Implicated in the <strong>design process</strong> and in constant collaboration with the UI/UX team <strong>(standups, sprint planning/retros)</strong>",
        "d": "Experience with creating <strong>clean and reusable components</strong>",
        "e": "Good understanding of Github and deployment "
    },
    "Desjardins": {
        "a": "Lead the development and introduced rigorous coding standards of our frontend application in <strong>Typescript using StencilJS</strong>",
        "b": "Developed new features for Desjardins' applications using the latest trends in tech and architecture",
        "c": "Worked with <strong>continuous integration pipelines</strong> developed from scratch which improved our deployment performance significantly <strong>(~5x) using Concourse CI</strong>",
        "d": "Developed a <strong>REST API</strong> (from scratch) using <strong>Spring Boot</strong>; integrated with <strong>PKCE</strong> to enhance the <strong>OAuth2 workflow</strong>",
        "e": "Wrote frontend/backend <strong>unit tests</strong> with a minimum <strong>coverage of 80%</strong> (on both) with the help of <strong>JaCoCo, Jest and Sonar</strong>"
    },
    "Bell": {
        "a": "<strong>Team lead</strong> for the entire lifecycle of the project. Created the UX design and the entire base architecture of the app's <strong>frontend</strong>",
        "b": "Created <strong>unit & integration tests</strong> for features added",
        "c": "Contributed to the <strong>development & maintenance</strong> of the <strong>REST API</strong> using <strong>C#</strong>",
        "d": "Worked with a <strong>complex database system</strong> and developed <strong>migrations scripts</strong> to automate data creation for testing"
    },
    "Discord": {
        "a": "Developed a discord bot with integrated commands and a queue system that plays music across channels using purely <strong>NodeJS/ExpressJS</strong>",
        "b": "Setup an <strong>EC2 Instance</strong> with automated configuration using <strong>Terraform</strong> and <strong>Ansible</strong>, allowing my bot to run 24/7 on it",
        "repo": "https://github.com/thenoobgrammer/bramble"
    },
    "Portfolio": {
        "a": "Developed a portfolio website using <strong>ReactJS</strong> and <strong>Tailwind CSS</strong>",
        "b": "Setup an statically hosted <strong>S3 bucket</strong> using a <strong>Hosted Zone</strong>, allowing me to automatically sync changes to the website with the run of a simple command",
        "c": "Using several libraries such as <strong>EmailJS</strong> for client contacts and <strong>i18n-next</strong> handling locales",
        "repo": "https://github.com/thenoobgrammer/my-portfolio"
    },
    "Pickside": {
        "a": "In the process to become an event planner/manager for sports activities across several regions starting with Montreal.",
        "b": "Develop(ing) a <strong>REST API</strong> with <strong>OAuth integrated</strong>, using <strong>NodeJS</<strong> and <strong>MongoDB</strong> for the collection",
        "c": "Frontend connected to <strong>Google's API</strong> service which will eventually become viable when the code is fully built",
        "d": "Develop(ing) the frontend using React 18 joined with TailwindCSS",
        "repo": "https://github.com/PickSide",
        "website": "https://pickside.net"
    },
    "Sadboiss": {
        "a": "Developed a very small E-Commerce website with a working cart, login system and an attempted payment system",
        "b": "Used C# for the backend with a structured MySQL database and a migration system",
        "c": "Used React for the frontend (no custom hooks) with old school reducers and action creators (Redux)",
        "repo": "https://github.com/Sadboiss"
    },
    "Project portfolio": "Project portfolio",
    "Project portfolio description": "A website portfolio is an essential tool for any professional who wants to showcase their work online. If you're looking to create a website portfolio that showcases your skills and accomplishments, I will help you.",
    "Full-fledged application": "Full-fledged application",
    "Full-fledged application description": "If your project is a bit more complex and you're looking for a complete solution, I have you covered. Together, we can turn your brilliant ideas into reality. I will work with you to design, conceptualize, and build your project from scratch.",
    "Hosting/Infrastructure": "Hosting/Infrastructure",
    "Hosting/Infrastructure description": "If you're having trouble finding ways to host your website, or you simply don't understand the process, there's no need to worry. I'm here to help you with that.",
    "Maintenance": "Maintenance",
    "Maintenance description": "I will maintain your website and ensure that it stays up-to-date with the latest technologies, guaranteeing its continuous functionality.",
    "Full name": "Full name",
    "Email": "Email",
    "Inquiry": "Description",
    "Contact form": "Contact form",
    "Contact me": "Contact me",
    "Send email": "Send email",
    "I am a": "I am a",
    "Senior Fullstack developer": "Senior Fullstack developer",
    "Home": "Home",
    "About": "About",
    "Services": "Services",
    "Close": "Close",
    "Save": "Save",
    "Little more about me": "Little more about me",
    "Senior Fullstack Developer": "Senior Fullstack Developer",
    "Senior Frontend Engineer": "Senior Frontend Engineer",
    "Fullstack engineer": "Fullstack engineer",
    "I'm Fullstack developer with over 4 years of experience": "I'm a Fullstack developer with over 4 years of experience",
    "Years of": "Years of",
    "Experience": "Experience",
    "Projects": "Projects",
    "Completed": "Completed",
    "Clients": "Clients",
    "Satisfied": "Satisfied",
    "About me content": "I have a passion for helping people build their online presence. My expertise lies in creating custom websites that are tailored to your unique needs. Whether you're a small business owner looking to establish an online presence, or an individual looking to showcase your portfolio, I can help bring your vision to life.",
    "Click here to access repo": "Click here to access repo",
    "Click here to go to website": "Click here to go to website",
    "Your request": "Your request",
    "Wrong format": "Field in the wrong format",
    "Is required": "Field required",
    "Description": "Description",
    "Describe your project": "Describe your inquiry"
}