{
    "Montreal, QC": "Montreal, QC",
    "English": "English",
    "French": "French",
    "My LinkedIn": "My LinkedIn",
    "My Github": "My Github",
    "Software Engineering": "Software Engineering",
    "Computer Science (Certificate)": "Computer Science (Certificate)",
    "Computer Science & technology": "Computer Science & technology",
    "Vanier College": "Vanier College",
    "Rest API application": "Rest API application",
    "Web development": "Web development",
    "My CV": "My CV",
    "Personal information": "Personal information",
    "Skillset": "Skillset",
    "Education": "Education",
    "Work experience": "Work experience",
    "Technologies": "Technologies",
    "Personal highlights": "Personal highlights",
    "In progress": "In progress",
    "Banner.intro": "If you're looking for a skilled web developer with a passion for creating professional websites, look no further! With 4 years of experience in the field, I'm dedicated to delivering high-quality work that meets my clients' needs and exceeds their expectations. Whether you're looking for a simple, elegant website or a complex, feature-rich platform, I have the expertise and creativity to bring your vision to life. Let's work together to build something amazing!",
    "GoTo": {
        "a": "In charge of transitionning legacy features (modularly) into a newer platform developed with React, allowing 85% of clients to have a more modern experience",
        "b": "Created fully functional, tested and documented components for internal teams to use across submodules throughout their development",
        "c": "Collaborated with UI/UX to bring forth a better experience for existing and potentially new clients",
        "d": "Demo'ing features in front of clients, showcasing the team's effort"
    },
    "Desjardins": {
        "a": "Lead the development and introduced rigorous coding standards of our frontend application in Typescript using StencilJS",
        "b": "Developed new features for Desjardins' applications using the latest trends in tech and architecture",
        "c": "Successfully set up our continuous integration pipeline from scratch which improved our deployment performance significantly (~5x) using Concourse CI",
        "d": "Successfully setup an API for our backend to accept calls from other internal applications using Spring Boot"
    },
    "Bell": {
        "a": "Team lead for the entire lifecycle of the project. Created the UX design and the entire base architecture of the app's frontend",
        "b": "Created automated testing (unit and integration testing) for every new feature added",
        "c": "After project completion, switched to the backend team and helped develop and maintain new features in C#",
        "d": "Debug, fixed a complex database system and helped update the backend automated migrations scripts"
    },
    "Discord": {
        "a": "Developed a discord bot with integrated commands and a queue system that plays music across channels using purely NodeJS",
        "b": "Setup an EC2 Instance with automated configuration using Terraform and Ansible, allowing my bot to run 24/7 on it",
        "repo": "https://github.com/thenoobgrammer/bramble"
    },
    "Portfolio": {
        "a": "Developed a portfolio website using ReactJS and Tailwind CSS",
        "b": "Setup an statically hosted S3 bucket that runs on a Hosted Zone, allowing me to automatically sync changes to the website with the run of a simple command",
        "c": "Using several libraries such as EmailJS for client contacts and i18n-next handling locales",
        "repo": "https://github.com/thenoobgrammer/my-portfolio"
    },
    "Pickside": {
        "a": "Eventually to be an event planner/manager for sports activities across several regions (Quebec, Toronto, etc...)",
        "b": "Developed a REST API with OAuth Bearer token authentication, in NodeJS that is also connected to a MongoDB server",
        "c": "Frontend connected to Google's official map service which will eventually become viable when the code is fully built",
        "d": "Developed the frontend in React 18 with a well structured repo using custom hooks and Material-UI (will eventually move to tailwind CSS).",
        "repo": "https://github.com/PickSide"
    },
    "Sadboiss": {
        "a": "Developed a very small E-Commerce website with a working cart, login system and an attempted payment system",
        "b": "Used C# for the backend with a structured MySQL database and a migration system",
        "c": "Used React for the frontend (no custom hooks) with old school reducers and action creators (Redux)",
        "repo": "https://github.com/Sadboiss"
    },
    "Project portfolio": "Project portfolio",
    "Project portfolio description": "A website portfolio is an essential tool for any professional who wants to showcase their work online. If you're looking to create a website portfolio that showcases your skills and accomplishments, I will help you.",
    "Full-fledged application": "Full-fledged application",
    "Full-fledged application description": "If your project is a bit more complex and you're looking for a complete solution, I have you covered. Together, we can turn your brilliant ideas into reality. I will work with you to design, conceptualize, and build your project from scratch.",
    "Hosting/Infrastructure": "Hosting/Infrastructure",
    "Hosting/Infrastructure description": "If you're having trouble finding ways to host your website, or you simply don't understand the process, there's no need to worry. I'm here to help you with that.",
    "Maintenance": "Maintenance",
    "Maintenance description": "I will maintain your website and ensure that it stays up-to-date with the latest technologies, guaranteeing its continuous functionality.",
    "Designed and implemented an online store application from start to finish using React JS and Redux": "Designed and implemented an online store application from start to finish using React JS and Redux",
    "Use of custom hooks through out the frontend to make use of better implementation design": "Use of custom hooks through out the frontend to make use of better implementation design",
    "Successfully developed a REST API backend in with NodeJS": "Successfully developed a REST API backend in with NodeJS",
    "Implemented an Auth0 support for authentication through the backend": "Implemented an Auth0 support for authentication through the backend",
    "Attached a functional mongodb database to my backend with an initializer script that populates collections upon first start": "Attached a functional mongodb database to my backend with an initializer script that populates collections upon first start",
    "Full name": "Full name",
    "Email": "Email",
    "Inquiry": "Description",
    "Contact form": "Contact form",
    "Contact me": "Contact me",
    "Send email": "Send email",
    "I am a": "I am a",
    "Senior Fullstack developer": "Senior Fullstack developer",
    "Home": "Home",
    "About": "About",
    "Services": "Services",
    "About me": "About me",
    "I'm Fullstack developer with over 4 years of experience": "I'm a Fullstack developer with over 4 years of experience",
    "Years of": "Years of",
    "Experience": "Experience",
    "Projects": "Projects",
    "Completed": "Completed",
    "Clients": "Clients",
    "Satisfied": "Satisfied",
    "About me content": "I have a passion for helping people build their online presence. My expertise lies in creating custom websites that are tailored to your unique needs. Whether you're a small business owner looking to establish an online presence, or an individual looking to showcase your portfolio, I can help bring your vision to life.",
    "Click here to access": "Click here to access",
    "Your request": "Your request",
    "Wrong format": "Field in the wrong format",
    "Is required": "Field required",
    "Description": "Description",
    "Describe your project": "Describe your project"
}